Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.UnqualifiedWallWarn
Unable to create one or multiple walls as hosted walls on the target host elements.

Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.UnqualifiedWallTypeError
Stacked walls and curtain walls cannot maintain hosted relationships with other walls.

Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.PinnedElemCannotInteractWarn
The selected wall is pinned and cannot interact with the target host.

Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.CantAssociateWithHostError
The host and the hosted element are misaligned. Possible issues include non-parallel alignment, overlapping geometry, or the offset value being beyond the accepted range.

Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.AssociationFailed
Associate hosted wall to host failed.

Autodesk.Revit.DB.BuiltInFailures.HostedWallAssociationFailures.AssocToHostFailed
Failed to pick the target wall as host wall.